rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_MC_ME.h
/*! @name PRTN0_COFB0_STAT - Partition 0 COFB Set 0 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN0_COFB0_STAT_BLOCK3_MASK       (0x8U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK3_SHIFT      (3U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK3_WIDTH      (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK3(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK3_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK3_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK4_MASK       (0x10U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK4_SHIFT      (4U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK4_WIDTH      (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK4(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK4_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK4_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK5_MASK       (0x20U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK5_SHIFT      (5U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK5_WIDTH      (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK5(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK5_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK5_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK6_MASK       (0x40U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK6_SHIFT      (6U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK6_WIDTH      (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK6(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK6_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK6_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK7_MASK       (0x80U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK7_SHIFT      (7U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK7_WIDTH      (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK7(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK7_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK7_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK8_MASK       (0x100U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK8_SHIFT      (8U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK8_WIDTH      (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK8(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK8_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK8_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK9_MASK       (0x200U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK9_SHIFT      (9U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK9_WIDTH      (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK9(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK9_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK9_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK10_MASK      (0x400U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK10_SHIFT     (10U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK10_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK10(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK10_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK10_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK11_MASK      (0x800U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK11_SHIFT     (11U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK11_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK11(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK11_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK11_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK12_MASK      (0x1000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK12_SHIFT     (12U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK12_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK12(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK12_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK12_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK13_MASK      (0x2000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK13_SHIFT     (13U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK13_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK13(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK13_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK13_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK14_MASK      (0x4000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK14_SHIFT     (14U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK14_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK14(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK14_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK14_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK15_MASK      (0x8000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK15_SHIFT     (15U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK15_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK15(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK15_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK15_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK16_MASK      (0x10000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK16_SHIFT     (16U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK16_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK16(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK16_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK16_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK17_MASK      (0x20000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK17_SHIFT     (17U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK17_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK17(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK17_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK17_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK18_MASK      (0x40000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK18_SHIFT     (18U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK18_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK18(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK18_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK18_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK19_MASK      (0x80000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK19_SHIFT     (19U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK19_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK19(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK19_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK19_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK20_MASK      (0x100000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK20_SHIFT     (20U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK20_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK20(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK20_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK20_MASK)
/*! @} */

/*! @name PRTN0_COFB1_STAT - Partition 0 COFB Set 1 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN0_COFB1_STAT_BLOCK32_MASK      (0x1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK32_SHIFT     (0U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK32_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK32(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK32_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK32_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK33_MASK      (0x2U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK33_SHIFT     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK33_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK33(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK33_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK33_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK34_MASK      (0x4U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK34_SHIFT     (2U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK34_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK34(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK34_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK34_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK38_MASK      (0x40U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK38_SHIFT     (6U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK38_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK38(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK38_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK38_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK39_MASK      (0x80U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK39_SHIFT     (7U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK39_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK39(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK39_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK39_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK40_MASK      (0x100U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK40_SHIFT     (8U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK40_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK40(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK40_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK40_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK41_MASK      (0x200U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK41_SHIFT     (9U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK41_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK41(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK41_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK41_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK42_MASK      (0x400U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK42_SHIFT     (10U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK42_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK42(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK42_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK42_MASK)

