rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_MC_ME.h
/*! @name PRTN0_CORE2_STAT - Partition 0 Core 2 Status Register */
/*! @{ */

#define MC_ME_PRTN0_CORE2_STAT_CCS_MASK          (0x1U)
#define MC_ME_PRTN0_CORE2_STAT_CCS_SHIFT         (0U)
#define MC_ME_PRTN0_CORE2_STAT_CCS_WIDTH         (1U)
#define MC_ME_PRTN0_CORE2_STAT_CCS(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE2_STAT_CCS_SHIFT)) & MC_ME_PRTN0_CORE2_STAT_CCS_MASK)

#define MC_ME_PRTN0_CORE2_STAT_WFI_MASK          (0x80000000U)
#define MC_ME_PRTN0_CORE2_STAT_WFI_SHIFT         (31U)
#define MC_ME_PRTN0_CORE2_STAT_WFI_WIDTH         (1U)
#define MC_ME_PRTN0_CORE2_STAT_WFI(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE2_STAT_WFI_SHIFT)) & MC_ME_PRTN0_CORE2_STAT_WFI_MASK)
/*! @} */

/*! @name PRTN0_CORE2_ADDR - Partition 0 Core 2 Address Register */
/*! @{ */

#define MC_ME_PRTN0_CORE2_ADDR_ADDR_MASK         (0xFFFFFFFCU)
#define MC_ME_PRTN0_CORE2_ADDR_ADDR_SHIFT        (2U)
#define MC_ME_PRTN0_CORE2_ADDR_ADDR_WIDTH        (30U)
#define MC_ME_PRTN0_CORE2_ADDR_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE2_ADDR_ADDR_SHIFT)) & MC_ME_PRTN0_CORE2_ADDR_ADDR_MASK)
/*! @} */

/*! @name PRTN0_CORE4_PCONF - Partition 0 Core 4 Process Configuration Register */
/*! @{ */

#define MC_ME_PRTN0_CORE4_PCONF_CCE_MASK         (0x1U)
#define MC_ME_PRTN0_CORE4_PCONF_CCE_SHIFT        (0U)
#define MC_ME_PRTN0_CORE4_PCONF_CCE_WIDTH        (1U)
#define MC_ME_PRTN0_CORE4_PCONF_CCE(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE4_PCONF_CCE_SHIFT)) & MC_ME_PRTN0_CORE4_PCONF_CCE_MASK)
/*! @} */

/*! @name PRTN0_CORE4_PUPD - Partition 0 Core 4 Process Update Register */
/*! @{ */

#define MC_ME_PRTN0_CORE4_PUPD_CCUPD_MASK        (0x1U)
#define MC_ME_PRTN0_CORE4_PUPD_CCUPD_SHIFT       (0U)
#define MC_ME_PRTN0_CORE4_PUPD_CCUPD_WIDTH       (1U)
#define MC_ME_PRTN0_CORE4_PUPD_CCUPD(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE4_PUPD_CCUPD_SHIFT)) & MC_ME_PRTN0_CORE4_PUPD_CCUPD_MASK)
/*! @} */

/*! @name PRTN0_CORE4_STAT - Partition 0 Core 4 Status Register */
/*! @{ */

#define MC_ME_PRTN0_CORE4_STAT_CCS_MASK          (0x1U)
#define MC_ME_PRTN0_CORE4_STAT_CCS_SHIFT         (0U)
#define MC_ME_PRTN0_CORE4_STAT_CCS_WIDTH         (1U)
#define MC_ME_PRTN0_CORE4_STAT_CCS(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE4_STAT_CCS_SHIFT)) & MC_ME_PRTN0_CORE4_STAT_CCS_MASK)

#define MC_ME_PRTN0_CORE4_STAT_WFI_MASK          (0x80000000U)
#define MC_ME_PRTN0_CORE4_STAT_WFI_SHIFT         (31U)
#define MC_ME_PRTN0_CORE4_STAT_WFI_WIDTH         (1U)
#define MC_ME_PRTN0_CORE4_STAT_WFI(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE4_STAT_WFI_SHIFT)) & MC_ME_PRTN0_CORE4_STAT_WFI_MASK)
/*! @} */

/*! @name PRTN0_CORE4_ADDR - Partition 0 Core 4 Address Register */
/*! @{ */

#define MC_ME_PRTN0_CORE4_ADDR_ADDR_MASK         (0xFFFFFFFCU)
#define MC_ME_PRTN0_CORE4_ADDR_ADDR_SHIFT        (2U)
#define MC_ME_PRTN0_CORE4_ADDR_ADDR_WIDTH        (30U)
#define MC_ME_PRTN0_CORE4_ADDR_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE4_ADDR_ADDR_SHIFT)) & MC_ME_PRTN0_CORE4_ADDR_ADDR_MASK)
/*! @} */

/*! @name PRTN0_CORE5_PCONF - Partition 0 Core 5 Process Configuration Register */
/*! @{ */

#define MC_ME_PRTN0_CORE5_PCONF_CCE_MASK         (0x1U)
#define MC_ME_PRTN0_CORE5_PCONF_CCE_SHIFT        (0U)
#define MC_ME_PRTN0_CORE5_PCONF_CCE_WIDTH        (1U)
#define MC_ME_PRTN0_CORE5_PCONF_CCE(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE5_PCONF_CCE_SHIFT)) & MC_ME_PRTN0_CORE5_PCONF_CCE_MASK)
/*! @} */

/*! @name PRTN0_CORE5_PUPD - Partition 0 Core 5 Process Update Register */
/*! @{ */

#define MC_ME_PRTN0_CORE5_PUPD_CCUPD_MASK        (0x1U)
#define MC_ME_PRTN0_CORE5_PUPD_CCUPD_SHIFT       (0U)
#define MC_ME_PRTN0_CORE5_PUPD_CCUPD_WIDTH       (1U)
#define MC_ME_PRTN0_CORE5_PUPD_CCUPD(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE5_PUPD_CCUPD_SHIFT)) & MC_ME_PRTN0_CORE5_PUPD_CCUPD_MASK)
/*! @} */

/*! @name PRTN0_CORE5_STAT - Partition 0 Core 5 Status Register */
/*! @{ */

#define MC_ME_PRTN0_CORE5_STAT_CCS_MASK          (0x1U)
#define MC_ME_PRTN0_CORE5_STAT_CCS_SHIFT         (0U)
#define MC_ME_PRTN0_CORE5_STAT_CCS_WIDTH         (1U)
#define MC_ME_PRTN0_CORE5_STAT_CCS(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE5_STAT_CCS_SHIFT)) & MC_ME_PRTN0_CORE5_STAT_CCS_MASK)

#define MC_ME_PRTN0_CORE5_STAT_WFI_MASK          (0x80000000U)
#define MC_ME_PRTN0_CORE5_STAT_WFI_SHIFT         (31U)
#define MC_ME_PRTN0_CORE5_STAT_WFI_WIDTH         (1U)
#define MC_ME_PRTN0_CORE5_STAT_WFI(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE5_STAT_WFI_SHIFT)) & MC_ME_PRTN0_CORE5_STAT_WFI_MASK)
/*! @} */

/*! @name PRTN0_CORE5_ADDR - Partition 0 Core 5 Address Register */
/*! @{ */

#define MC_ME_PRTN0_CORE5_ADDR_ADDR_MASK         (0xFFFFFFFCU)
#define MC_ME_PRTN0_CORE5_ADDR_ADDR_SHIFT        (2U)
#define MC_ME_PRTN0_CORE5_ADDR_ADDR_WIDTH        (30U)
#define MC_ME_PRTN0_CORE5_ADDR_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE5_ADDR_ADDR_SHIFT)) & MC_ME_PRTN0_CORE5_ADDR_ADDR_MASK)
/*! @} */

/*! @name PRTN1_PCONF - Partition 1 Process Configuration Register */
/*! @{ */

#define MC_ME_PRTN1_PCONF_PCE_MASK               (0x1U)
#define MC_ME_PRTN1_PCONF_PCE_SHIFT              (0U)
#define MC_ME_PRTN1_PCONF_PCE_WIDTH              (1U)
#define MC_ME_PRTN1_PCONF_PCE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_PCONF_PCE_SHIFT)) & MC_ME_PRTN1_PCONF_PCE_MASK)
/*! @} */

/*! @name PRTN1_PUPD - Partition 1 Process Update Register */
/*! @{ */

#define MC_ME_PRTN1_PUPD_PCUD_MASK               (0x1U)
#define MC_ME_PRTN1_PUPD_PCUD_SHIFT              (0U)
#define MC_ME_PRTN1_PUPD_PCUD_WIDTH              (1U)
#define MC_ME_PRTN1_PUPD_PCUD(x)                 (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_PUPD_PCUD_SHIFT)) & MC_ME_PRTN1_PUPD_PCUD_MASK)
/*! @} */

/*! @name PRTN1_STAT - Partition 1 Status Register */
/*! @{ */

#define MC_ME_PRTN1_STAT_PCS_MASK                (0x1U)
#define MC_ME_PRTN1_STAT_PCS_SHIFT               (0U)
#define MC_ME_PRTN1_STAT_PCS_WIDTH               (1U)
#define MC_ME_PRTN1_STAT_PCS(x)                  (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_STAT_PCS_SHIFT)) & MC_ME_PRTN1_STAT_PCS_MASK)
/*! @} */

/*! @name PRTN1_COFB0_STAT - Partition 1 COFB Set 0 Clock Status Register */
/*! @{ */

