rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_MC_ME.h
#define MC_ME_PRTN1_COFB1_STAT_BLOCK54_MASK      (0x400000U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK54_SHIFT     (22U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK54_WIDTH     (1U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK54(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_STAT_BLOCK54_SHIFT)) & MC_ME_PRTN1_COFB1_STAT_BLOCK54_MASK)

#define MC_ME_PRTN1_COFB1_STAT_BLOCK55_MASK      (0x800000U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK55_SHIFT     (23U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK55_WIDTH     (1U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK55(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_STAT_BLOCK55_SHIFT)) & MC_ME_PRTN1_COFB1_STAT_BLOCK55_MASK)

#define MC_ME_PRTN1_COFB1_STAT_BLOCK56_MASK      (0x1000000U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK56_SHIFT     (24U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK56_WIDTH     (1U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK56(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_STAT_BLOCK56_SHIFT)) & MC_ME_PRTN1_COFB1_STAT_BLOCK56_MASK)

#define MC_ME_PRTN1_COFB1_STAT_BLOCK58_MASK      (0x4000000U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK58_SHIFT     (26U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK58_WIDTH     (1U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK58(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_STAT_BLOCK58_SHIFT)) & MC_ME_PRTN1_COFB1_STAT_BLOCK58_MASK)

#define MC_ME_PRTN1_COFB1_STAT_BLOCK59_MASK      (0x8000000U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK59_SHIFT     (27U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK59_WIDTH     (1U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK59(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_STAT_BLOCK59_SHIFT)) & MC_ME_PRTN1_COFB1_STAT_BLOCK59_MASK)

#define MC_ME_PRTN1_COFB1_STAT_BLOCK60_MASK      (0x10000000U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK60_SHIFT     (28U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK60_WIDTH     (1U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK60(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_STAT_BLOCK60_SHIFT)) & MC_ME_PRTN1_COFB1_STAT_BLOCK60_MASK)

#define MC_ME_PRTN1_COFB1_STAT_BLOCK61_MASK      (0x20000000U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK61_SHIFT     (29U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK61_WIDTH     (1U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK61(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_STAT_BLOCK61_SHIFT)) & MC_ME_PRTN1_COFB1_STAT_BLOCK61_MASK)

#define MC_ME_PRTN1_COFB1_STAT_BLOCK62_MASK      (0x40000000U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK62_SHIFT     (30U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK62_WIDTH     (1U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK62(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_STAT_BLOCK62_SHIFT)) & MC_ME_PRTN1_COFB1_STAT_BLOCK62_MASK)

#define MC_ME_PRTN1_COFB1_STAT_BLOCK63_MASK      (0x80000000U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK63_SHIFT     (31U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK63_WIDTH     (1U)
#define MC_ME_PRTN1_COFB1_STAT_BLOCK63(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_STAT_BLOCK63_SHIFT)) & MC_ME_PRTN1_COFB1_STAT_BLOCK63_MASK)
/*! @} */

/*! @name PRTN1_COFB2_STAT - Partition 1 COFB Set 2 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN1_COFB2_STAT_BLOCK65_MASK      (0x2U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK65_SHIFT     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK65_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK65(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK65_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK65_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK66_MASK      (0x4U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK66_SHIFT     (2U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK66_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK66(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK66_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK66_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK67_MASK      (0x8U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK67_SHIFT     (3U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK67_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK67(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK67_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK67_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK68_MASK      (0x10U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK68_SHIFT     (4U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK68_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK68(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK68_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK68_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK69_MASK      (0x20U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK69_SHIFT     (5U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK69_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK69(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK69_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK69_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK70_MASK      (0x40U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK70_SHIFT     (6U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK70_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK70(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK70_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK70_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK73_MASK      (0x200U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK73_SHIFT     (9U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK73_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK73(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK73_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK73_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK74_MASK      (0x400U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK74_SHIFT     (10U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK74_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK74(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK74_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK74_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK75_MASK      (0x800U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK75_SHIFT     (11U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK75_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK75(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK75_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK75_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK76_MASK      (0x1000U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK76_SHIFT     (12U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK76_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK76(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK76_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK76_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK77_MASK      (0x2000U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK77_SHIFT     (13U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK77_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK77(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK77_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK77_MASK)

