rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_MC_ME.h
#define MC_ME_PRTN1_COFB0_CLKEN_REQ31_MASK       (0x80000000U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ31_SHIFT      (31U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ31_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ31(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_CLKEN_REQ31_SHIFT)) & MC_ME_PRTN1_COFB0_CLKEN_REQ31_MASK)
/*! @} */

/*! @name PRTN1_COFB1_CLKEN - Partition 1 COFB Set 1 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN1_COFB1_CLKEN_REQ32_MASK       (0x1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ32_SHIFT      (0U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ32_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ32(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ32_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ32_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ33_MASK       (0x2U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ33_SHIFT      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ33_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ33(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ33_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ33_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ34_MASK       (0x4U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ34_SHIFT      (2U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ34_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ34(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ34_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ34_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ42_MASK       (0x400U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ42_SHIFT      (10U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ42_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ42(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ42_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ42_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ45_MASK       (0x2000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ45_SHIFT      (13U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ45_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ45(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ45_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ45_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ47_MASK       (0x8000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ47_SHIFT      (15U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ47_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ47(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ47_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ47_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ53_MASK       (0x200000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ53_SHIFT      (21U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ53_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ53(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ53_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ53_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ56_MASK       (0x1000000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ56_SHIFT      (24U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ56_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ56(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ56_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ56_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ63_MASK       (0x80000000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ63_SHIFT      (31U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ63_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ63(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ63_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ63_MASK)
/*! @} */

/*! @name PRTN1_COFB2_CLKEN - Partition 1 COFB Set 2 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN1_COFB2_CLKEN_REQ65_MASK       (0x2U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ65_SHIFT      (1U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ65_WIDTH      (1U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ65(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_CLKEN_REQ65_SHIFT)) & MC_ME_PRTN1_COFB2_CLKEN_REQ65_MASK)

#define MC_ME_PRTN1_COFB2_CLKEN_REQ66_MASK       (0x4U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ66_SHIFT      (2U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ66_WIDTH      (1U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ66(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_CLKEN_REQ66_SHIFT)) & MC_ME_PRTN1_COFB2_CLKEN_REQ66_MASK)

#define MC_ME_PRTN1_COFB2_CLKEN_REQ67_MASK       (0x8U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ67_SHIFT      (3U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ67_WIDTH      (1U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ67(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_CLKEN_REQ67_SHIFT)) & MC_ME_PRTN1_COFB2_CLKEN_REQ67_MASK)

#define MC_ME_PRTN1_COFB2_CLKEN_REQ68_MASK       (0x10U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ68_SHIFT      (4U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ68_WIDTH      (1U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ68(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_CLKEN_REQ68_SHIFT)) & MC_ME_PRTN1_COFB2_CLKEN_REQ68_MASK)

#define MC_ME_PRTN1_COFB2_CLKEN_REQ69_MASK       (0x20U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ69_SHIFT      (5U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ69_WIDTH      (1U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ69(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_CLKEN_REQ69_SHIFT)) & MC_ME_PRTN1_COFB2_CLKEN_REQ69_MASK)

#define MC_ME_PRTN1_COFB2_CLKEN_REQ70_MASK       (0x40U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ70_SHIFT      (6U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ70_WIDTH      (1U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ70(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_CLKEN_REQ70_SHIFT)) & MC_ME_PRTN1_COFB2_CLKEN_REQ70_MASK)

#define MC_ME_PRTN1_COFB2_CLKEN_REQ73_MASK       (0x200U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ73_SHIFT      (9U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ73_WIDTH      (1U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ73(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_CLKEN_REQ73_SHIFT)) & MC_ME_PRTN1_COFB2_CLKEN_REQ73_MASK)

#define MC_ME_PRTN1_COFB2_CLKEN_REQ74_MASK       (0x400U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ74_SHIFT      (10U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ74_WIDTH      (1U)
#define MC_ME_PRTN1_COFB2_CLKEN_REQ74(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_CLKEN_REQ74_SHIFT)) & MC_ME_PRTN1_COFB2_CLKEN_REQ74_MASK)

