rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_MC_ME.h
#define MC_ME_PRTN2_COFB2_CLKEN_REQ65_MASK       (0x2U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ65_SHIFT      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ65_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ65(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ65_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ65_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ66_MASK       (0x4U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ66_SHIFT      (2U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ66_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ66(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ66_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ66_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ67_MASK       (0x8U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ67_SHIFT      (3U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ67_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ67(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ67_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ67_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ68_MASK       (0x10U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ68_SHIFT      (4U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ68_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ68(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ68_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ68_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ69_MASK       (0x20U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ69_SHIFT      (5U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ69_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ69(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ69_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ69_MASK)
/*! @} */

/*! @name PRTN3_PCONF - Partition 3 Process Configuration Register */
/*! @{ */

#define MC_ME_PRTN3_PCONF_PCE_MASK               (0x1U)
#define MC_ME_PRTN3_PCONF_PCE_SHIFT              (0U)
#define MC_ME_PRTN3_PCONF_PCE_WIDTH              (1U)
#define MC_ME_PRTN3_PCONF_PCE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_PCONF_PCE_SHIFT)) & MC_ME_PRTN3_PCONF_PCE_MASK)
/*! @} */

/*! @name PRTN3_PUPD - Partition 3 Process Update Register */
/*! @{ */

#define MC_ME_PRTN3_PUPD_PCUD_MASK               (0x1U)
#define MC_ME_PRTN3_PUPD_PCUD_SHIFT              (0U)
#define MC_ME_PRTN3_PUPD_PCUD_WIDTH              (1U)
#define MC_ME_PRTN3_PUPD_PCUD(x)                 (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_PUPD_PCUD_SHIFT)) & MC_ME_PRTN3_PUPD_PCUD_MASK)
/*! @} */

/*! @name PRTN3_STAT - Partition 3 Status Register */
/*! @{ */

#define MC_ME_PRTN3_STAT_PCS_MASK                (0x1U)
#define MC_ME_PRTN3_STAT_PCS_SHIFT               (0U)
#define MC_ME_PRTN3_STAT_PCS_WIDTH               (1U)
#define MC_ME_PRTN3_STAT_PCS(x)                  (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_STAT_PCS_SHIFT)) & MC_ME_PRTN3_STAT_PCS_MASK)
/*! @} */

/*! @name PRTN3_COFB0_STAT - Partition 3 COFB Set 0 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN3_COFB0_STAT_BLOCK0_MASK       (0x1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK0_SHIFT      (0U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK0_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK0(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK0_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK0_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK1_MASK       (0x2U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK1_SHIFT      (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK1_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK1(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK1_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK1_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK2_MASK       (0x4U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK2_SHIFT      (2U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK2_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK2(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK2_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK2_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK3_MASK       (0x8U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK3_SHIFT      (3U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK3_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK3(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK3_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK3_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK4_MASK       (0x10U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK4_SHIFT      (4U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK4_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK4(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK4_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK4_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK5_MASK       (0x20U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK5_SHIFT      (5U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK5_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK5(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK5_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK5_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK6_MASK       (0x40U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK6_SHIFT      (6U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK6_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK6(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK6_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK6_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK7_MASK       (0x80U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK7_SHIFT      (7U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK7_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK7(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK7_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK7_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK8_MASK       (0x100U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK8_SHIFT      (8U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK8_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK8(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK8_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK8_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK9_MASK       (0x200U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK9_SHIFT      (9U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK9_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK9(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK9_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK9_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK10_MASK      (0x400U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK10_SHIFT     (10U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK10_WIDTH     (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK10(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK10_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK10_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK11_MASK      (0x800U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK11_SHIFT     (11U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK11_WIDTH     (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK11(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK11_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK11_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK12_MASK      (0x1000U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK12_SHIFT     (12U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK12_WIDTH     (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK12(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK12_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK12_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK13_MASK      (0x2000U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK13_SHIFT     (13U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK13_WIDTH     (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK13(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK13_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK13_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK14_MASK      (0x4000U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK14_SHIFT     (14U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK14_WIDTH     (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK14(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK14_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK14_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK15_MASK      (0x8000U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK15_SHIFT     (15U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK15_WIDTH     (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK15(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK15_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK15_MASK)

