rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_MC_ME.h
#define MC_ME_PRTN3_COFB0_STAT_BLOCK29_MASK      (0x20000000U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK29_SHIFT     (29U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK29_WIDTH     (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK29(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK29_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK29_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK30_MASK      (0x40000000U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK30_SHIFT     (30U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK30_WIDTH     (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK30(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK30_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK30_MASK)
/*! @} */

/*! @name PRTN3_COFB1_STAT - Partition 3 COFB Set 1 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN3_COFB1_STAT_BLOCK32_MASK      (0x1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK32_SHIFT     (0U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK32_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK32(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK32_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK32_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK34_MASK      (0x4U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK34_SHIFT     (2U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK34_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK34(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK34_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK34_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK35_MASK      (0x8U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK35_SHIFT     (3U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK35_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK35(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK35_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK35_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK36_MASK      (0x10U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK36_SHIFT     (4U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK36_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK36(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK36_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK36_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK37_MASK      (0x20U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK37_SHIFT     (5U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK37_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK37(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK37_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK37_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK40_MASK      (0x100U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK40_SHIFT     (8U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK40_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK40(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK40_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK40_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK41_MASK      (0x200U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK41_SHIFT     (9U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK41_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK41(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK41_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK41_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK44_MASK      (0x1000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK44_SHIFT     (12U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK44_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK44(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK44_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK44_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK46_MASK      (0x4000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK46_SHIFT     (14U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK46_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK46(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK46_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK46_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK47_MASK      (0x8000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK47_SHIFT     (15U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK47_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK47(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK47_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK47_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK48_MASK      (0x10000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK48_SHIFT     (16U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK48_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK48(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK48_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK48_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK49_MASK      (0x20000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK49_SHIFT     (17U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK49_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK49(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK49_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK49_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK50_MASK      (0x40000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK50_SHIFT     (18U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK50_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK50(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK50_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK50_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK51_MASK      (0x80000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK51_SHIFT     (19U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK51_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK51(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK51_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK51_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK52_MASK      (0x100000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK52_SHIFT     (20U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK52_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK52(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK52_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK52_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK53_MASK      (0x200000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK53_SHIFT     (21U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK53_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK53(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK53_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK53_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK54_MASK      (0x400000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK54_SHIFT     (22U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK54_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK54(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK54_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK54_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK55_MASK      (0x800000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK55_SHIFT     (23U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK55_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK55(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK55_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK55_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK56_MASK      (0x1000000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK56_SHIFT     (24U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK56_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK56(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK56_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK56_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK57_MASK      (0x2000000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK57_SHIFT     (25U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK57_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK57(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK57_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK57_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK58_MASK      (0x4000000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK58_SHIFT     (26U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK58_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK58(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK58_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK58_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK59_MASK      (0x8000000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK59_SHIFT     (27U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK59_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK59(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK59_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK59_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK61_MASK      (0x20000000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK61_SHIFT     (29U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK61_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK61(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK61_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK61_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK62_MASK      (0x40000000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK62_SHIFT     (30U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK62_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK62(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK62_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK62_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK63_MASK      (0x80000000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK63_SHIFT     (31U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK63_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK63(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK63_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK63_MASK)
/*! @} */

