rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_MC_ME.h
/*! @name PRTN3_COFB2_STAT - Partition 3 COFB Set 2 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN3_COFB2_STAT_BLOCK64_MASK      (0x1U)
#define MC_ME_PRTN3_COFB2_STAT_BLOCK64_SHIFT     (0U)
#define MC_ME_PRTN3_COFB2_STAT_BLOCK64_WIDTH     (1U)
#define MC_ME_PRTN3_COFB2_STAT_BLOCK64(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB2_STAT_BLOCK64_SHIFT)) & MC_ME_PRTN3_COFB2_STAT_BLOCK64_MASK)

#define MC_ME_PRTN3_COFB2_STAT_BLOCK65_MASK      (0x2U)
#define MC_ME_PRTN3_COFB2_STAT_BLOCK65_SHIFT     (1U)
#define MC_ME_PRTN3_COFB2_STAT_BLOCK65_WIDTH     (1U)
#define MC_ME_PRTN3_COFB2_STAT_BLOCK65(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB2_STAT_BLOCK65_SHIFT)) & MC_ME_PRTN3_COFB2_STAT_BLOCK65_MASK)
/*! @} */

/*! @name PRTN3_COFB0_CLKEN - Partition 3 COFB Set 0 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN3_COFB0_CLKEN_REQ0_MASK        (0x1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ0_SHIFT       (0U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ0_WIDTH       (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ0(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ0_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ0_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ1_MASK        (0x2U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ1_SHIFT       (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ1_WIDTH       (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ1(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ1_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ1_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ2_MASK        (0x4U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ2_SHIFT       (2U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ2_WIDTH       (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ2(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ2_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ2_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ3_MASK        (0x8U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ3_SHIFT       (3U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ3_WIDTH       (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ3(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ3_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ3_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ4_MASK        (0x10U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ4_SHIFT       (4U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ4_WIDTH       (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ4(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ4_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ4_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ5_MASK        (0x20U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ5_SHIFT       (5U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ5_WIDTH       (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ5(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ5_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ5_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ6_MASK        (0x40U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ6_SHIFT       (6U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ6_WIDTH       (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ6(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ6_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ6_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ7_MASK        (0x80U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ7_SHIFT       (7U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ7_WIDTH       (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ7(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ7_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ7_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ8_MASK        (0x100U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ8_SHIFT       (8U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ8_WIDTH       (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ8(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ8_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ8_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ9_MASK        (0x200U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ9_SHIFT       (9U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ9_WIDTH       (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ9(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ9_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ9_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ10_MASK       (0x400U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ10_SHIFT      (10U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ10_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ10(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ10_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ10_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ11_MASK       (0x800U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ11_SHIFT      (11U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ11_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ11(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ11_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ11_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ12_MASK       (0x1000U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ12_SHIFT      (12U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ12_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ12(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ12_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ12_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ13_MASK       (0x2000U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ13_SHIFT      (13U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ13_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ13(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ13_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ13_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ14_MASK       (0x4000U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ14_SHIFT      (14U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ14_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ14(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ14_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ14_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ15_MASK       (0x8000U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ15_SHIFT      (15U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ15_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ15(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ15_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ15_MASK)
/*! @} */

/*! @name PRTN3_COFB1_CLKEN - Partition 3 COFB Set 1 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN3_COFB1_CLKEN_REQ32_MASK       (0x1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ32_SHIFT      (0U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ32_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ32(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ32_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ32_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ34_MASK       (0x4U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ34_SHIFT      (2U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ34_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ34(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ34_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ34_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ35_MASK       (0x8U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ35_SHIFT      (3U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ35_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ35(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ35_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ35_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ36_MASK       (0x10U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ36_SHIFT      (4U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ36_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ36(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ36_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ36_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ37_MASK       (0x20U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ37_SHIFT      (5U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ37_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ37(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ37_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ37_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ40_MASK       (0x100U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ40_SHIFT      (8U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ40_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ40(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ40_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ40_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ41_MASK       (0x200U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ41_SHIFT      (9U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ41_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ41(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ41_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ41_MASK)

