rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_MC_ME.h
#define MC_ME_PRTN3_COFB1_CLKEN_REQ44_MASK       (0x1000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ44_SHIFT      (12U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ44_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ44(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ44_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ44_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ46_MASK       (0x4000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ46_SHIFT      (14U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ46_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ46(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ46_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ46_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ47_MASK       (0x8000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ47_SHIFT      (15U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ47_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ47(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ47_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ47_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ48_MASK       (0x10000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ48_SHIFT      (16U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ48_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ48(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ48_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ48_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ49_MASK       (0x20000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ49_SHIFT      (17U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ49_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ49(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ49_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ49_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ50_MASK       (0x40000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ50_SHIFT      (18U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ50_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ50(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ50_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ50_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ51_MASK       (0x80000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ51_SHIFT      (19U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ51_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ51(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ51_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ51_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ52_MASK       (0x100000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ52_SHIFT      (20U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ52_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ52(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ52_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ52_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ53_MASK       (0x200000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ53_SHIFT      (21U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ53_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ53(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ53_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ53_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ54_MASK       (0x400000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ54_SHIFT      (22U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ54_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ54(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ54_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ54_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ55_MASK       (0x800000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ55_SHIFT      (23U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ55_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ55(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ55_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ55_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ56_MASK       (0x1000000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ56_SHIFT      (24U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ56_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ56(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ56_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ56_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ57_MASK       (0x2000000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ57_SHIFT      (25U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ57_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ57(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ57_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ57_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ58_MASK       (0x4000000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ58_SHIFT      (26U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ58_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ58(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ58_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ58_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ59_MASK       (0x8000000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ59_SHIFT      (27U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ59_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ59(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ59_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ59_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ61_MASK       (0x20000000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ61_SHIFT      (29U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ61_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ61(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ61_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ61_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ62_MASK       (0x40000000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ62_SHIFT      (30U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ62_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ62(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ62_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ62_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ63_MASK       (0x80000000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ63_SHIFT      (31U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ63_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ63(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ63_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ63_MASK)
/*! @} */

/*! @name PRTN3_COFB2_CLKEN - Partition 3 COFB Set 2 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN3_COFB2_CLKEN_REQ64_MASK       (0x1U)
#define MC_ME_PRTN3_COFB2_CLKEN_REQ64_SHIFT      (0U)
#define MC_ME_PRTN3_COFB2_CLKEN_REQ64_WIDTH      (1U)
#define MC_ME_PRTN3_COFB2_CLKEN_REQ64(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB2_CLKEN_REQ64_SHIFT)) & MC_ME_PRTN3_COFB2_CLKEN_REQ64_MASK)

#define MC_ME_PRTN3_COFB2_CLKEN_REQ65_MASK       (0x2U)
#define MC_ME_PRTN3_COFB2_CLKEN_REQ65_SHIFT      (1U)
#define MC_ME_PRTN3_COFB2_CLKEN_REQ65_WIDTH      (1U)
#define MC_ME_PRTN3_COFB2_CLKEN_REQ65(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB2_CLKEN_REQ65_SHIFT)) & MC_ME_PRTN3_COFB2_CLKEN_REQ65_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group MC_ME_Register_Masks */

/*!
 * @}
 */ /* end of group MC_ME_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K37_MC_ME_H_) */
